VR관리자/CM_006/Main.yml
config:
  target: "https://komscoverse-vr-admin.kro.kr"
  tls:
    rejectUnauthorized: false
  phases:
    - duration: 3
      arrivalRate: 100
      rampTo: 100
      name: Warm-up phase
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75

scenarios:
  - name: "Create Admin and log in"
    flow:
      - post:
          url: "/app/main/set-admin-contents"
          headers:
            sessionToken: "YTc5ODZiZjViYjNmOTE0ZTpURHo1MENxeVlNamJmcUw3b2xRN0J3PT0=" #임시 세션토큰입니다 어드민 로그인 하시고 재발급 받으셔야합니다.
          json:
            contents: "test"
          capture:
            json: "$"
            as: response
      - log: "{{response}}"